Dols592/DFC_ESP8266FtpServer/src/DFC_ESP8266FtpServer.cpp
/*
*/

//library includes
#include "DFC_ESP8266FtpServer.h"
#include <ESP8266WiFi.h>
#include <FS.h>

//Config defines
#define FTP_DEBUG
#define FTP_CONTROL_PORT        21
#define FTP_CONTROL_TIMEOUT     300000
#define FTP_DATA_PORT_START     20100
#define FTP_DATA_PORT_END       20200
#define FTP_DATA_BUF_SIZE       1000
#define FTP_DATA_TIMEOUT        30000

//debug
#undef DBG
#undef DBGLN
#undef DBGF

#ifdef FTP_DEBUG
  #define DBG(...) Serial.print( __VA_ARGS__ )
  #define DBGLN(...) Serial.println( __VA_ARGS__ )
  #define DBGF(...) Serial.printf( __VA_ARGS__ )
#else
  #define DBG(...)
  #define DBGLN(...)
  #define DBGF(...)
#endif

DFC_ESP7266FtpServer::DFC_ESP7266FtpServer()
  : mFtpServer( FTP_CONTROL_PORT )
  , mLastDataPort(FTP_DATA_PORT_START)
{
}

void DFC_ESP7266FtpServer::Init()
{
  SPIFFS.info(mSpiffsInfo);
  mFtpServer.begin();
}

void DFC_ESP7266FtpServer::Loop()
{
  if (mFtpServer.hasClient())
  {
    int32_t Pos = -1;
    if (!Help_GetEmptyClientInfo(Pos))
    {
      WiFiClient OverflowClient = mFtpServer.available();
      if (!OverflowClient.connected()) //Client disconnected before we could handle
      {
        DBGLN("A new ftp connection disconnected before we could handle.");
        return;
      }
      OverflowClient.println( "10068 Too many users !");
      OverflowClient.flush();
      OverflowClient.stop();
      return;
    }

    //send welcome message
    mClientInfo[Pos].ClientConnection = mFtpServer.available();
    if (!mClientInfo[Pos].ClientConnection.connected()) //Client disconnected before we could handle
    {
      DBGLN("A new data connection disconnected before we could handle.");
      return;
    }
    mClientInfo[Pos].FtpState = NFS_WAITFORUSERNAME;
    mClientInfo[Pos].LastReceivedCommand = millis();
    mClientInfo[Pos].ClientConnection.println( "220 --==[ Welcome ]==--");
  }

  for (int32_t i=0; i<FTP_MAX_CLIENTS; i++)
  {
    if (mClientInfo[i].InUse)
    {
      Loop_ClientConnection(mClientInfo[i]);
    }
  }
}

void DFC_ESP7266FtpServer::Loop_ClientConnection(SClientInfo& Client)
{
  //is still connected?
  if (!Client.ClientConnection.connected())
    Help_DisconnectClient(Client);
  
  //check for timeout on data connection
  if (Client.TransferCommand == NTC_NONE)
  {
    int32 Stopwatch = millis() - Client.LastReceivedCommand;
    if (Stopwatch > FTP_CONTROL_TIMEOUT)
    {
      DBGLN(("Timeout on ClientConnection. Disconnecting"));
      Client.ClientConnection.println( "221- Timeout, Disconnecting.");
      Help_DisconnectClient(Client);
      return;
    }
  }

  //Check for new Data Connection
  if (Client.PasvListenServer && Client.PasvListenServer->hasClient())
  {
    Client.DataConnection = Client.PasvListenServer->available();
    if (!Client.DataConnection.connected())
      return;
    
    Client.LastReceivedData = millis();
    Client.WaitingForDataConnection = false;

    IPAddress Lip = Client.DataConnection.localIP();
    IPAddress Rip = Client.DataConnection.remoteIP();
    uint16_t Lport = Client.DataConnection.localPort();
    uint16_t Rport = Client.DataConnection.remotePort();
    //String(Lip);
    DBG("Local:");
    DBG(Lip);
    DBG(":");
    DBG(Lport);
    DBG("  ");
    DBG(Rip);
    DBG(":");
    DBG(Rport);
    DBGLN("");
  }

  //Check for new control data
  Loop_GetControlData(Client);
  Loop_DataConnection(Client);
}

void DFC_ESP7266FtpServer::Loop_GetControlData(SClientInfo& Client)
{
  while(1)
  {
    int32_t NextChr = Client.ClientConnection.read();
    if (NextChr < 0 || NextChr > 0xFF)
      break;

    //<CR> or <LF>
    if (NextChr == '\r' || NextChr == '\n')
    {
      if (Client.ControlState == NCS_START) //initial spaces
        continue;

      Loop_ProcessCommand(Client);
      Client.Arguments = "";
      Client.ControlState = NCS_START;
      continue;
    }

    // unwanted characters (control ascii and high-ascii)
    if (NextChr < 0x20 || NextChr > 0x7F)
      continue;

    //space seperator
    if (NextChr == ' ')
    {
      if (Client.ControlState == NCS_START) //initial spaces
        continue;

      if (Client.ControlState == NFS_COMMAND) //initial spaces
      {
        Client.ControlState = NFS_ARGUMENTS;
        Client.Arguments = "";
        continue;
      }
    }

    if (Client.ControlState == NCS_START)
    {
      Client.ControlState = NFS_COMMAND;
      Client.Command = "";
    }

    if (Client.ControlState == NFS_COMMAND)
      Client.Command += (char) NextChr;

    if (Client.ControlState == NFS_ARGUMENTS)
      Client.Arguments += (char) NextChr;
  }
}

void DFC_ESP7266FtpServer::Loop_ProcessCommand(SClientInfo& Client)
{
  //preprocess
  Client.Command.trim();
  Client.Arguments.trim();
  const String& cmd(Client.Command); //for easy access

  DBG("Command: ");
  DBG(cmd.c_str());
  DBG(" ");
  DBGLN(Client.Arguments.c_str());
  
  bool Handled(true);
  
  if (Client.SeqCommand.length() > 0 && !cmd.equalsIgnoreCase(Client.SeqCommand))
  {
    //sequence error
    Client.ClientConnection.printf( "503 Bad sequence of commands. Command %s expected.\r\n", Client.SeqCommand.c_str());
    Client.SeqCommand = "";
    Client.SeqArgument = "";
    return;
  }

  if (cmd.equalsIgnoreCase("USER")) Process_USER(Client);
  else if (cmd.equalsIgnoreCase("PASS")) Process_PASS(Client);
  else if (Client.FtpState < NFS_WAITFORCOMMAND)
  {
    DBG("Command Refused. Not logged in.");
    Client.ClientConnection.println( "530 Login needed.");
    return;
  }
  else if (cmd.equalsIgnoreCase("QUIT")) Process_QUIT(Client);
  else if (cmd.equalsIgnoreCase("SYST")) Process_SYST(Client);
  else if (cmd.equalsIgnoreCase("FEAT")) Process_FEAT(Client);
  else if (cmd.equalsIgnoreCase("HELP")) Process_HELP(Client);
  else if (cmd.equalsIgnoreCase("PWD")) Process_PWD(Client);
  else if (cmd.equalsIgnoreCase("CDUP")) Process_CDUP(Client);
  else if (cmd.equalsIgnoreCase("CWD")) Process_CWD(Client);
  else if (cmd.equalsIgnoreCase("MKD")) Process_MKD(Client);
  else if (cmd.equalsIgnoreCase("RMD")) Process_RMD(Client);
  else if (cmd.equalsIgnoreCase("TYPE")) Process_TYPE(Client);
  else if (cmd.equalsIgnoreCase("PASV")) Process_PASV(Client);
  //else if (cmd.equalsIgnoreCase("PORT")) Process_PORT(Client);
  else if (cmd.equalsIgnoreCase("LIST")) Process_LIST(Client);
  else if (cmd.equalsIgnoreCase("SIZE")) Process_SIZE(Client);
  else if (cmd.equalsIgnoreCase("DELE")) Process_DELE(Client);
  else if (cmd.equalsIgnoreCase("STOR")) Process_STOR(Client);
  else if (cmd.equalsIgnoreCase("RETR")) Process_RETR(Client);
  else if (cmd.equalsIgnoreCase("ABOR")) Process_ABOR(Client);
  else if (cmd.equalsIgnoreCase("NOOP")) Process_NOOP(Client);
  else if (cmd.equalsIgnoreCase("RNFR")) Process_RNFR(Client);
  else if (cmd.equalsIgnoreCase("RNTO")) Process_RNTO(Client);
  else
  {
    Client.ClientConnection.printf( "500 Unknown command %s.\n\r", cmd.c_str());
    Handled = false;
  }
  
  if (Handled)
  {
    Client.LastReceivedCommand = millis();
  }
}

void DFC_ESP7266FtpServer::Process_USER(SClientInfo& Client)
{
  if (Client.FtpState > NFS_WAITFORPASSWORD)
  {
    Client.ClientConnection.println( "530 Changing user is not allowed.");
    return;
  }

  //check if user exists
  bool UsernameOK(false);
  if (mServerUsername.length() == 0) //we accept every username
    UsernameOK = true;
  else if (mServerUsername.equalsIgnoreCase(Client.Arguments))
    UsernameOK = true;

  //username is wrong, we request password, but always will be rejected.
  if (!UsernameOK)
  {
    Client.ClientConnection.println( "331 OK. Password required");
    Client.FtpState = NFS_WAITFORPASSWORD_USER_REJECTED;
    return;
  }

  if (mServerPassword.length() == 0) //we don't need a password
  {
    Client.ClientConnection.println( "230 OK.");
    Client.FtpState = NFS_WAITFORCOMMAND;
  }
  else
  {
    Client.ClientConnection.println( "331 OK. Password required");
    Client.FtpState = NFS_WAITFORPASSWORD;
  }
}

void DFC_ESP7266FtpServer::Process_PASS(SClientInfo& Client)
{
  if (Client.FtpState <= NFS_WAITFORUSERNAME)
  {
    Client.ClientConnection.println( "503 Login with USER first.");
    return;
  }
  if (Client.FtpState > NFS_WAITFORPASSWORD)
  {
    Client.ClientConnection.println( "230 Already logged in.");
    return;
  }

  if (Client.FtpState == NFS_WAITFORPASSWORD_USER_REJECTED || !mServerPassword.equals(Client.Arguments))
  {
    Client.ClientConnection.println( "530 Username/Password wrong.");
    Help_DisconnectClient(Client);
    return;
  }

  Client.ClientConnection.println( "230 Logged in.");
  Client.FtpState = NFS_WAITFORCOMMAND;
}

void DFC_ESP7266FtpServer::Process_QUIT(SClientInfo& Client)
{
  Help_DisconnectClient(Client);
}

void DFC_ESP7266FtpServer::Process_SYST(SClientInfo& Client)
{
  Client.ClientConnection.println( "215 UNIX esp8266.");
}

