Dols592/DFC_ESP8266FtpServer/src/DFC_ESP8266FtpServer.cpp
void DFC_ESP7266FtpServer::Process_FEAT(SClientInfo& Client)
{
  Client.ClientConnection.println( "211- Supported Features.");
  Client.ClientConnection.println( " LIST");
  Client.ClientConnection.println( "211 end");
}


void DFC_ESP7266FtpServer::Process_HELP(SClientInfo& Client)
{
  Client.ClientConnection.println( "214 Ask the whizzkid for help.");
}

void DFC_ESP7266FtpServer::Process_PWD(SClientInfo& Client)
{
  Client.ClientConnection.printf( "257 \"%s\" Current Directory.\r\n", Client.CurrentPath.c_str());
}

void DFC_ESP7266FtpServer::Process_CDUP(SClientInfo& Client)
{
  String NewPath;
  Help_GetParentDir(Client.CurrentPath, NewPath);

  Client.CurrentPath = NewPath;
  Client.ClientConnection.printf( "250 Directory successfully changed to %s\r\n", NewPath.c_str());
}

//Because directories are simulated, we accept CWD to
//dir that does not "exists".
void DFC_ESP7266FtpServer::Process_CWD(SClientInfo& Client)
{
  String NewPath = Help_GetPath(Client, true);

  Client.CurrentPath = NewPath;
  Client.ClientConnection.printf( "250 Directory successfully changed to %s\r\n", NewPath.c_str());
  DBGLN("New Directory: " + NewPath);
}

void DFC_ESP7266FtpServer::Process_MKD(SClientInfo& Client)
{
  Client.TempDirectory = Help_GetPath(Client, true);
  Client.ClientConnection.printf( "257 \"%s\" is created.\n\r", Client.TempDirectory.c_str());
}

//we never accept directory removal. If all
//files are removed, directorie is removed automatically
void DFC_ESP7266FtpServer::Process_RMD(SClientInfo& Client)
{
  String Directory = Help_GetPath(Client, true);
  if (Help_DirExist(Directory))
  {
    Client.ClientConnection.printf( "550 Directory \"%s\" not removed. It's not empty.\n\r", Directory.c_str());
    return;
  }

  if (Client.TempDirectory.indexOf(Directory) == 0)
    Client.TempDirectory = "";

  Client.ClientConnection.printf( "250 Directory \"%s\" is removed.\n\r", Directory.c_str());
}

void DFC_ESP7266FtpServer::Process_TYPE(SClientInfo& Client)
{
  const String& arg(Client.Arguments); //for easy access

  if (arg.equalsIgnoreCase("A"))
    Client.ClientConnection.println( "200 TYPE is now ASII.");
  else if (arg.equalsIgnoreCase("I"))
    Client.ClientConnection.println( "200 TYPE is now 8-bit binary.");
  else
    Client.ClientConnection.println( "504 Unknow TYPE.");
}

void DFC_ESP7266FtpServer::Process_PASV(SClientInfo& Client)
{
  IPAddress LocalIP = Client.ClientConnection.localIP();
  if (Client.PasvListenServer == NULL)
  {
    Client.PasvListenPort = Help_GetNextDataPort();
    Client.PasvListenServer = new WiFiServer(Client.PasvListenPort);
    Client.PasvListenServer->begin();
  }

  int32_t PasvPort = Client.PasvListenPort;
  Client.ClientConnection.println( "227 Entering Passive Mode ("+ String(LocalIP[0]) + "," + String(LocalIP[1])+","+ String(LocalIP[2])+","+ String(LocalIP[3])+","+String( PasvPort >> 8 ) +","+String ( PasvPort & 255 )+").");
  Client.TransferMode = NTC_PASSIVE;
}

void DFC_ESP7266FtpServer::Process_PORT(SClientInfo& Client)
{
  //Client.TransferMode = NTC_ACTIVE;
}

void DFC_ESP7266FtpServer::Process_LIST(SClientInfo& Client)
{
  if (!Process_DataCommand_Preprocess(Client))
    return;
  
  //Other check's and preprocessing
  
  Process_DataCommand_Responds_OK(Client, NTC_LIST);
}

void DFC_ESP7266FtpServer::Process_SIZE(SClientInfo& Client)
{
  //check filename
  String FilePath = Help_GetPath(Client, false);
  if (!SPIFFS.exists(FilePath))
  {
    Client.ClientConnection.printf( "550 File %s does not exist.\r\n", FilePath.c_str());
    return;
  }
  
  File FileHandle = SPIFFS.open(FilePath, "r");
  if (!FileHandle)
  {
    Client.ClientConnection.printf( "550 File %s could not be opened.\r\n", FilePath.c_str());
    return;
  }
  
  Client.ClientConnection.println( "213 " + String(FileHandle.size()));
  FileHandle.close();
}

void DFC_ESP7266FtpServer::Process_DELE(SClientInfo& Client)
{
  //check filename
  String FilePath = Help_GetPath(Client, false);
  if (!SPIFFS.exists(FilePath))
  {
    Client.ClientConnection.printf( "550 File %s does not exist.\r\n", FilePath.c_str());
    return;
  }

  if (!SPIFFS.remove(FilePath))
    Client.ClientConnection.printf( "550 File %s could not be deleted.\r\n", FilePath.c_str());
  else
    Client.ClientConnection.printf( "250 File %s successful deleted.\r\n", FilePath.c_str());
}

void DFC_ESP7266FtpServer::Process_STOR(SClientInfo& Client)
{
  if (!Process_DataCommand_Preprocess(Client))
    return;

  String FilePath = Help_GetPath(Client, false);
  if (FilePath.length() > mSpiffsInfo.maxPathLength-1)
  {
    Client.ClientConnection.printf( "553 File %s exeeds filename length of %d characters.\r\n", FilePath.c_str(), mSpiffsInfo.maxPathLength-1);
    return;
  }

  if (Client.TransferFile)
    Client.TransferFile.close();
  
  Client.TransferFile = SPIFFS.open(FilePath, "w");
  if (!Client.TransferFile)
  {
    Client.ClientConnection.printf( "452 File %s can not be opened.\r\n", FilePath.c_str());
    return;
  }

  Process_DataCommand_Responds_OK(Client, NTC_STOR);
}

void DFC_ESP7266FtpServer::Process_RETR(SClientInfo& Client)
{
  if (!Process_DataCommand_Preprocess(Client))
    return;

  //check filename
  String FilePath = Help_GetPath(Client, false);
  if (!SPIFFS.exists(FilePath))
  {
    Client.ClientConnection.printf( "550 File %s does not exist.\r\n", FilePath.c_str());
    return;
  }

  if (Client.TransferFile)
    Client.TransferFile.close();

  Client.TransferFile = SPIFFS.open(FilePath, "r");
  if (!Client.TransferFile)
  {
    Client.ClientConnection.printf( "550 File %s can not be opened.\r\n", FilePath.c_str());
    return;
  }
 
  Process_DataCommand_Responds_OK(Client, NTC_RETR);
}

void DFC_ESP7266FtpServer::Process_ABOR(SClientInfo& Client)
{
  if (Client.TransferCommand != NTC_NONE)
  {
    Client.ClientConnection.println( "426 Connection closed; transfer aborted.");
    Process_DataCommand_END(Client);
  }
  
  Client.ClientConnection.println( "226 Transfer successful aborted.");
}

void DFC_ESP7266FtpServer::Process_NOOP(SClientInfo& Client)
{
  Client.ClientConnection.println( "200 Nooping Done.");
}

void DFC_ESP7266FtpServer::Process_RNFR(SClientInfo& Client)
{
  //get and check argument
  String Path = Help_GetFirstArgument(Client);
  if (Path.length() == 0)
  {
    Client.ClientConnection.println( "501 No filename is given.");
    return;
  }

