Dols592/DFC_ESP8266FtpServer/src/DFC_ESP8266FtpServer.cpp
  //Get FilePath
  String FilePath = Help_GetPath(Client, false);
  if (SPIFFS.exists(FilePath))
  {
    Client.ClientConnection.printf( "350 File %s going to be renamed. RNTO expected next.\r\n", FilePath.c_str());
    Client.SeqCommand = "RNTO";
    Client.SeqArgument = FilePath;
  }
  else if (Help_DirExist(FilePath))
  {
    Client.ClientConnection.printf( "350 Directory %s going to be renamed. RNTO expected next.\r\n", FilePath.c_str());
    Client.SeqCommand = "RNTO";
    Client.SeqArgument = FilePath;
  }
  else
  {
    Client.ClientConnection.printf( "550 File %s does not exist.\r\n", FilePath.c_str());
  }
}

void DFC_ESP7266FtpServer::Process_RNTO(SClientInfo& Client)
{
  if (!Client.SeqCommand.equalsIgnoreCase("RNTO"))
  {
    Client.ClientConnection.println( "503 Bad sequence of commands. RNFR needs to be done first.");
    return;
  }
  
  Client.SeqCommand = "";
  
  //get and check argument
  String Path = Help_GetFirstArgument(Client);
  if (Path.length() == 0)
  {
    Client.ClientConnection.println( "501 No filename is given.");
    return;
  }

  //Get FilePath
  String FilePath = Help_GetPath(Client, false);
  if (FilePath.length() > mSpiffsInfo.maxPathLength-1)
  {
    Client.ClientConnection.printf( "553 File %s exeeds filename length of %d characters.\r\n", FilePath.c_str(), mSpiffsInfo.maxPathLength-1);
    return;
  }
  
  //Check if destination doesn't exists.
  if (SPIFFS.exists(FilePath))
  {
    Client.ClientConnection.printf( "553 Destination filename %s already exists.\r\n", FilePath.c_str(), mSpiffsInfo.maxPathLength-1);
    return;
  }
  else if (Help_DirExist(FilePath))
  {
    Client.ClientConnection.printf( "553 Destination directory %s already exists.\r\n", FilePath.c_str(), mSpiffsInfo.maxPathLength-1);
    return;
  }
  
  //renaming one file
  if (SPIFFS.exists(Client.SeqArgument))
  {
    if (SPIFFS.rename(Client.SeqArgument, FilePath))
      Client.ClientConnection.printf( "250 file %s renamed to %s.\r\n", Client.SeqArgument.c_str(), FilePath.c_str());
    else
      Client.ClientConnection.printf( "451 file %s renaming to %s failed.\r\n", Client.SeqArgument.c_str(), FilePath.c_str());
    return;
  }
  
  //renaming whole directory.
  
  //check if filename of the new file is not to long for ALL files !
  int32_t MaxSourceNameLength = mSpiffsInfo.maxPathLength-1 + ((int32_t) Client.SeqArgument.length()) - ((int32_t) FilePath.length());
  Dir FindDir = SPIFFS.openDir("/");
  while (FindDir.next())
  {
    if (FindDir.fileName().length() > MaxSourceNameLength)
    {
      Client.ClientConnection.printf( "553 one of more of files in directory will exceeds the maximum filename size of %d characters.\r\n", mSpiffsInfo.maxPathLength-1);
      return;
    }
  }  
  
  //now rename alle the files
  FindDir = SPIFFS.openDir("/");
  while (FindDir.next())
  {
    String SrcName = FindDir.fileName();
    String DstName(SrcName);

    if (DstName.indexOf(Client.SeqArgument) == 0)
    {
      DstName.replace(Client.SeqArgument, FilePath);
      if (SPIFFS.rename(SrcName, DstName))
        Client.ClientConnection.printf( "250-file %s renamed to %s.\r\n", SrcName.c_str(), DstName.c_str());
      else
        Client.ClientConnection.printf( "250-file %s renaming to %s failed.\r\n", SrcName.c_str(), DstName.c_str());      
    }
  }

  Client.ClientConnection.printf( "250 directory %s renamed to %s.\r\n", Client.SeqArgument.c_str(), FilePath.c_str());
}

void DFC_ESP7266FtpServer::Loop_DataConnection(SClientInfo& Client)
{
  if (Client.PasvListenServer == NULL)
    return;
  
  //425 Can't open data connection.
  //
  
  if (!Client.DataConnection.connected())
  {
    if (Client.WaitingForDataConnection)
    {
      int32 Stopwatch = millis() - Client.LastReceivedData;
      if (Stopwatch > FTP_DATA_TIMEOUT)
      {
        DBGLN(("Timeout on waiting for data connection."));
        Client.ClientConnection.println( "425 Can't open data connection.");
        Process_DataCommand_END(Client);
        return;
      }
    }
    else if (Client.TransferCommand != NTC_NONE)       //Client disconnected during transfer
    {
       Process_DataCommand_DISCONNECTED(Client);  //Handle disconnect event
       Process_DataCommand_END(Client);           //Close data connectin, gracefully.
    }
    return;
  }

  //check for timeout on data connection
  int32 Stopwatch = millis() - Client.LastReceivedData;
  if (Stopwatch > FTP_DATA_TIMEOUT)
  {
    DBGLN(("It's quiet on the dataconnection. Closing."));
    Client.ClientConnection.println( "426 Connection closed; transfer aborted. Timeout on data connection.");
    Process_DataCommand_END(Client);
    return;
  }
  
  //process some data for current command
  if (Client.TransferCommand == NTC_LIST) Process_Data_LIST(Client);
  else if (Client.TransferCommand == NTC_STOR) Process_Data_STOR(Client);
  else if (Client.TransferCommand == NTC_RETR) Process_Data_RETR(Client);
}

bool DFC_ESP7266FtpServer::Process_DataCommand_Preprocess(SClientInfo& Client)
{
  if (Client.TransferMode == NTM_UNKNOWN)
  {
    Client.ClientConnection.println( "425 Use PORT or PASV first.");
    return false;
  }
  if (Client.TransferCommand != NTC_NONE)
  {
    Client.ClientConnection.println( "450 Requested file action not taken, already an command is in process.");
    return false;
  }
  return true;
}

void DFC_ESP7266FtpServer::Process_DataCommand_Responds_OK(SClientInfo& Client, nTransferCommand TransferCommand)
{
  if (!Client.DataConnection.connected())
  {
    Client.ClientConnection.println( "150 Accepted data connection.");
    Client.WaitingForDataConnection = true;
    Client.LastReceivedData = millis();
  }
  else
    Client.ClientConnection.println( "125 Data connection already open; transfer starting.");

  Client.TransferCommand = TransferCommand;
  Loop_DataConnection(Client);
}

void DFC_ESP7266FtpServer::Process_DataCommand_END(SClientInfo& Client)
{
  DBGLN("Data send/received. Closing data connection.");
  Client.DataConnection.flush();
  Client.DataConnection.stop();
  
  Client.TransferFile.close();
  
