Dols592/DFC_ESP8266FtpServer/src/DFC_ESP8266FtpServer.cpp
  Client.WaitingForDataConnection = false;
  Client.LastReceivedCommand = millis(); //Transfer done. Reset timeout on client connection.
  Client.TransferCommand = NTC_NONE;
}

void DFC_ESP7266FtpServer::Process_DataCommand_DISCONNECTED(SClientInfo& Client)
{
  switch (Client.TransferCommand)
  {
    //Data connection lost before we send all data. It's a abort
    case NTC_LIST:
    case NTC_RETR:
      DBGLN(("Data connection unexpectacly closed while sending data."));
      Client.ClientConnection.println( "426 Data connection unexpectacly closed. transfer aborted.");
      break;

    //Data connection disconnected during receiving data.
    //Implicit this is a signal all data is send from client.
    //So it is a successfull transfer.
    case NTC_STOR:
      Client.ClientConnection.println( "226 Connection closed; transfer successful.");
      break;
  }
}

////                               0         1         2         3         4         5          
////                               012345678901234567890123456789012345678901234567890123456789
//  Client.DataConnection.println( "-rw-rw-rw-    1 0        0              22 Jan 01  1970 1MB.zip");
//  Client.DataConnection.println( "drw-rw-rw-    1 0        0               0 Jan 01  1970 SubDir");
void DFC_ESP7266FtpServer::Process_Data_LIST(SClientInfo& Client)
{
  DBGLN("Sending filelist.");

  Dir dir = SPIFFS.openDir(Client.CurrentPath);
  String FileName;
  String FilePath;
  bool IsDir;
  std::vector<String> DirList;
  while (dir.next())
  {
    String FilePath = dir.fileName();
    if (Help_GetFileName(Client.CurrentPath, FilePath, FileName, IsDir))
    {
      if (IsDir)
      {
        if (Help_CheckIfDirIsUnique(DirList, FileName))
        {
          Client.DataConnection.print("drw-rw-rw-    1 0        0               0 Jan 01  1970 ");
          Client.DataConnection.println(FileName);
        }
      }
      else
      {
        //Client.DataConnection.print("-rw-rw-rw-    1 0        0              22 Jan 01  1970 ");
        String FileSizeString = String(dir.fileSize());
        String WhiteSpaceString = String("              ");
        WhiteSpaceString = WhiteSpaceString.substring(FileSizeString.length());
        
        Client.DataConnection.print("-rw-rw-rw-    1 0        0  ");
        Client.DataConnection.print(WhiteSpaceString);
        Client.DataConnection.print(FileSizeString);        
        Client.DataConnection.print(" Jan 01  1970 ");
        Client.DataConnection.println(FileName);
      }
    }
  }
  
  //Append the TempDirectory created at MKD if we need to add it.
  //Help_GetFileName wil report it's a file, but we are sure it's a directory.
  //we ignore IsDir.
  if (Help_GetFileName(Client.CurrentPath, Client.TempDirectory, FileName, IsDir))
  {
    if (FileName.endsWith("/"))
      FileName.remove(FileName.length()-1);
    if (Help_CheckIfDirIsUnique(DirList, FileName))
    {
      Client.DataConnection.print("drw-rw-rw-    1 0        0               0 Jan 01  1970 ");
      Client.DataConnection.println(FileName);
    }
  }

  Client.ClientConnection.println( "226 File listing send.");
  Process_DataCommand_END(Client);
}

void DFC_ESP7266FtpServer::Process_Data_STOR(SClientInfo& Client)
{
  if (!Client.TransferFile)
  {
    Client.ClientConnection.println( "451 File error.");
    Process_DataCommand_END(Client);
    return;
  }

  uint8_t Data[FTP_DATA_BUF_SIZE];  
  int32_t BytesRead = Client.DataConnection.read(Data, FTP_DATA_BUF_SIZE);
  if (BytesRead > 0)
  {
    Client.TransferFile.write(Data, BytesRead);
    Client.LastReceivedData = millis();
  }
}

void DFC_ESP7266FtpServer::Process_Data_RETR(SClientInfo& Client)
{  
  if (!Client.TransferFile)
  {
    Client.ClientConnection.println( "451 File error.");
    Process_DataCommand_END(Client);
    return;
  }

  uint8_t Data[FTP_DATA_BUF_SIZE];
  int32_t BytesRead = Client.TransferFile.read(Data, FTP_DATA_BUF_SIZE);
  if (BytesRead > 0)
  {
    Client.DataConnection.write(Data, BytesRead);
    Client.LastReceivedData = millis();
  }
  else
  {
    Process_DataCommand_END(Client);
    Client.ClientConnection.println( "226 File transfer done.");
  }
}

bool DFC_ESP7266FtpServer::Help_GetEmptyClientInfo(int32_t& Pos)
{
  for (int32_t i=0; i<FTP_MAX_CLIENTS; i++)
  {
    if (!mClientInfo[i].InUse)
    {
      Pos = i;
      mClientInfo[i].InUse = true;
      return true;
    }
  }

  return false;
}

int32_t DFC_ESP7266FtpServer::Help_GetNextDataPort()
{
  int32_t NewPort = mLastDataPort;
  while (1)
  {
    NewPort++;
    if (NewPort >= FTP_DATA_PORT_END)
      NewPort = FTP_DATA_PORT_START;

    bool PortInUse = false;
    for (int32_t i=0; i<FTP_MAX_CLIENTS; i++)
    {
      if (mClientInfo[i].InUse && mClientInfo[i].PasvListenPort == NewPort)
        PortInUse = true;
    }

    if (!PortInUse)
      return NewPort;

    if (NewPort == mLastDataPort) //all possible ports are in use
     return 0;
  }
}

void DFC_ESP7266FtpServer::Help_DisconnectClient(SClientInfo& Client)
{
  if (Client.ClientConnection.connected())
    Client.ClientConnection.println("221 Goodbye");

  Client.Reset();
}

String DFC_ESP7266FtpServer::Help_GetFirstArgument(SClientInfo& Client)
{
  int32_t Start = 0;
  int32_t End = Client.Arguments.length();
  for (int32_t i = End-1; i>= 0; i--)
  {
    if (Client.Arguments.charAt(i) == ' ')
      End = i;
  }

  return Client.Arguments.substring(Start, End);
}

String DFC_ESP7266FtpServer::Help_GetPath(SClientInfo& Client, bool IsPath)
{
  String Path = Help_GetFirstArgument(Client);
  Path.replace("\\", "/");

  if (Path.length() == 0)
    Path = "/";
  else if (!Path.startsWith("/")) //its a absolute path
    Path = Client.CurrentPath + Path;

  if (IsPath)
    Path += "/";
 
  while (Path.indexOf("//") >= 0)
    Path.replace("//", "/");

  return Path;
}

/* Help_GetFileName

Input values
  CurrentDir : Full path of current directory to find files in.
  FilePath   : Full path of file to get name from.

output values
  FileName : Name of file or subdirectory. without path
  IsDir    : If FileName is a subdirectory (or an file)

