Dols592/DFC_ESP8266FtpServer/src/DFC_ESP8266FtpServer.cpp
Return value
  true  : Name found
  false : FilePath is file or subdirectory in CurrentDir
*/
bool DFC_ESP7266FtpServer::Help_GetFileName(String CurrentDir, String FilePath, String& FileName, bool& IsDir)
{
  int32_t FilePathSize = FilePath.length();
  int32_t CurrentDirSize = CurrentDir.length();

  if (FilePathSize <= CurrentDirSize)
    return false;

  if (FilePath.indexOf(CurrentDir) != 0)
    return false;

  int32_t NextSlash = FilePath.indexOf('/', CurrentDirSize);

  if (NextSlash < 0 || FilePathSize == NextSlash+1) //+1 is correct. We want the '/' if FILENAME ends with a '/'. 
  {
    FileName = FilePath.substring(CurrentDirSize);
    IsDir = false;
  }
  else
  {
    FileName = FilePath.substring(CurrentDirSize, NextSlash);
    IsDir = true;
  }

  return true;
}

bool DFC_ESP7266FtpServer::Help_GetParentDir(String FilePath, String& ParentDir)
{
  String Path = FilePath;
  Path.replace("\\", "/");
  while (Path.indexOf("//") >= 0)
    Path.replace("//", "/");

  if (Path.endsWith("/"))
    Path.remove(Path.length()-1);

  int32_t Pos = -1;
  int32_t LastSlash = Path.indexOf('/');
  while (LastSlash >= 0)
  {
    DBGF("LastSlash \"%d\"\r\n", LastSlash);
    Pos = LastSlash;
    LastSlash = Path.indexOf('/', LastSlash+1);
  }

  if (Pos < 0)
  {
    ParentDir = FilePath;
    return false;
  }

  ParentDir = FilePath.substring(0, Pos+1);
  return true;
}

//If directory exist, it's automatically not emtpy, because Empty directories do not exist.
//DirPath needs to be absolute
bool DFC_ESP7266FtpServer::Help_DirExist(String DirPath)
{
  if (!DirPath.endsWith("/"))
    DirPath += "/";

  Dir FindDir = SPIFFS.openDir("/");
  while (FindDir.next())
  {
    String FilePath = FindDir.fileName();
    if (FilePath.indexOf(DirPath) == 0 && FilePath.length() > DirPath.length())
      return true;
  }  
  return false;
}

//creates a list with unique names. If a name is already present in list,
//it returns false.
bool DFC_ESP7266FtpServer::Help_CheckIfDirIsUnique(std::vector<String>& DirList, const String& Name)
{
  bool Found(false);
  for (std::vector<String>::iterator it=DirList.begin(); it!=DirList.end(); it++)
  {
    if (Name.equals(*it))
      Found = true;
  }

  if (!Found)
  {
    DirList.push_back(Name);
  }
  
  return !Found;
}